app/models/user.rb

    def self.find_for_oauth(auth)
    user = User.where(uid: auth.uid, provider: auth.provider).first

    unless user
      user = User.create(
        provider: auth.provider,
        uid:      auth.uid,
        name:     auth.info.name,
        email:    auth.info.email,
        image:    auth.info.image,
        token:    auth.credentials.token,
        password: Devise.friendly_token[0, 20]
      )
---
SELECT "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? ORDER BY "users"."id" ASC LIMIT ?  [["uid", "109946844009221672863"], ["provider", "google_oauth2"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "username", "image", "uid", "token", "provider", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)